In [3]:
import pandas as pd
import numpy as np

In [6]:
df=pd.DataFrame(np.random.randn(3,3),index=["r1","r2","r3"],columns=["c1","c2","c3"])
df

          c1        c2        c3
r1  0.173630  1.236957  1.503292
r2 -0.679226  0.733992  1.535571
r3  0.018313 -0.827080 -0.549703

In [7]:
df["none"]=None

In [8]:
df

          c1        c2        c3  none
r1  0.173630  1.236957  1.503292  None
r2 -0.679226  0.733992  1.535571  None
r3  0.018313 -0.827080 -0.549703  None

In [12]:
df.fillna("Hello")

          c1        c2        c3   none
r1  0.173630  1.236957  1.503292  Hello
r2 -0.679226  0.733992  1.535571  Hello
r3  0.018313 -0.827080 -0.549703  Hello

In [14]:
df.dropna()

Empty DataFrame
Columns: [c1, c2, c3, none]
Index: []

In [16]:
df.dropna(axis=1)

          c1        c2        c3
r1  0.173630  1.236957  1.503292
r2 -0.679226  0.733992  1.535571
r3  0.018313 -0.827080 -0.549703

In [25]:
df.fillna(value=df.sum(axis=1))

          c1        c2        c3  none
r1  0.173630  1.236957  1.503292  None
r2 -0.679226  0.733992  1.535571  None
r3  0.018313 -0.827080 -0.549703  None

In [28]:
df.dropna(axis=1,inplace=True)

In [29]:
df

          c1        c2        c3
r1  0.173630  1.236957  1.503292
r2 -0.679226  0.733992  1.535571
r3  0.018313 -0.827080 -0.549703

In [34]:
df["sum"]=df.sum(axis=1)

In [35]:
df

          c1        c2        c3       sum
r1  0.173630  1.236957  1.503292  5.827759
r2 -0.679226  0.733992  1.535571  3.180675
r3  0.018313 -0.827080 -0.549703 -2.716939